#Generated by Fabric Compiler ( version 2024.2-SP1.2 <build 187561> ) at Tue Feb 10 08:48:46 2026

add_design C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/prj/Tieta_S/ipcore/pll_i25M_o50M_o25M/pll_i25M_o50M_o25M.idf
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/Tieta_Feiteng_2001_top.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/pon_reset.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/timer_gen_50mhz.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/synclib.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/p2s_master.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/p2s_slave.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/pch_cpld_espi_ram.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/pcie_dync_alloc.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/pcie_slot_number.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/pvt_gpi.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/s2p_master.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/s2p_slave.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/uart_master.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/UART_MASTER_VPP.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/fan_ctrl/FanControl.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/delay_timer.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/edge_delay.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/edge_detect.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/Edge_Detect1.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/edge_sync.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/led_blink_code.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/lowpass_filter.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/pme_filter.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/post_leds.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/pwrcap_pwrbtn_led.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/system_reset.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/thermal.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/UID_Function.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include/as03mb03_define.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include/pwrseq_define.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include/tpm_define.v"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.pon_reset} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/WDT.v"
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/WDT_init.v"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/i2c/I2C_SLAVE_INF.v"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
add_design "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/i2c/I2C_SLAVE_REG.v"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/pwrcap_pwrbtn_led.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/thermal.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/pch_cpld_espi_ram.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/delay_timer.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/edge_sync.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/led_blink_code.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/lowpass_filter.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/pme_filter.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/post_leds.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/system_reset.v"
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/common/UID_Function.v"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
remove_design -verilog "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/communication/p2s_master.v"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/prj/Tieta_S/Tieta_S.fdc"
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_option max_threads 0
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG400
compile -top_module {work.Tieta_Feiteng_2001_top} -include_path {C:/CPLD/pango/2_Tieta_Feiteng/Tieta_Feiteng_2001_PGC7KD69MBG400/rtl/include} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
